{
  "Navbar": {
    "text1": "Quem sou",
    "text2": "Conhecimentos",
    "text3": "Serviços",
    "text4": "Projetos",
    "text5": "Contato"
  },
  "Home": {
    "title": "Olá, eu sou",
    "typedString1": "Desenvolvedor Full Stack",
    "typedString2": "Especialista em React.js",
    "typedString3": "Desenvolvedor Next.js",
    "button": "contato"
  },
  "AboutMe": {
    "title": "Quem sou",
    "text": "Olá! Sou Igor Rocha, Full Stack Engineer com mais de 6 anos de experiência desenvolvendo aplicações web escaláveis e de alta performance em mercados LATAM. Especializado em React.js, Next.js, TypeScript e Tailwind CSS, construindo interfaces responsivas e sustentáveis que geram engajamento mensurável dos usuários. Experiente com Node.js, NestJS, PostgreSQL e Prisma, entregando integrações de API confiáveis e soluções backend. Contribuí para projetos internacionais como Cinemark LATAM, melhorando performance do sistema, experiência do usuário e workflows de release. Forte defensor de Clean Code, princípios SOLID e práticas modernas de DevOps (Docker, GitHub Actions, CI/CD). Colaborativo e orientado à qualidade, consistentemente entregando soluções alinhadas ao negócio em ambientes ágeis e multifuncionais."
  },
  "Services": {
    "title": "Serviços",
    "box1": {
      "title": "Websites e Blogs",
      "text": "Criação de websites e blogs personalizados."
    },
    "box2": {
      "title": "E-commerce",
      "text": "Construção de plataformas de comércio eletrônico robustas e escaláveis,"
    },
    "box3": {
      "title": "Dashboards",
      "text": "Desenvolvimento de painéis de controle personalizados e visualizações de dados."
    },
    "box4": {
      "title": "Sistemas de Gerenciamento",
      "text": "Criação de sistemas personalizados para gerenciamento de projetos."
    }
  },
  "Experiences": {
    "title": "Experiências",
    "experiece1": {
      "year": "2018-2019",
      "text": [
        "Desenvolvimento e manutenção de páginas em Wordpress ou Vtex para Phooto.",
        "Desenvolvimento e manutenção de E-mail Marketing.",
        "Elaboração de códigos para alterações de páginas de destino de acordo com parâmetros recebidos.",
        "Implementação das melhores práticas do SEO."
      ]
    },
    "experiece2": {
      "year": "2019-2019",
      "text": [
        "Desenvolvimento de e-commerce na plataforma VTEX para Katmandu, Vivenda do camarão, Caído Pneus usando HTML5, SCSS, Javascript, jQuery.",
        "Desenvolvimento de novas funcionalidades e refatoração de código.",
        "Automatização de processos utilizando o Postman Collection Runner.",
        "Desenvolvimento e manutenção de websites com Wordpress para São Cristóvão, Saesp e Bardal.",
        "Melhoria do desempenho seguindo boas práticas apontadas pelo Google Pagespeed."
      ]
    },
    "experiece3": {
      "year": "2020-2024",
      "text": [
        "Desenvolvi e mantive uma plataforma de e-commerce na VTEX para Rihappy.com.br, utilizando HTML5, SCSS, JavaScript, jQuery, Gulp, Babel, Node.js, Webpack, React, TypeScript e GraphQL, melhorando a velocidade de carregamento das páginas e as taxas de conversão dos clientes.",
        "Implementei novas funcionalidades e refatorei código legado com Next.js e Tailwind CSS, aprimorando o desempenho e a manutenibilidade da aplicação, reduzindo bugs de front-end em 25%.",
        "Gerenciei controle de versão e processos de CI com Bitbucket e GitLab, garantindo integridade do código e colaboração eficiente da equipe.",
        "Apliquei metodologia Scrum para otimizar o gerenciamento de projetos, melhorando a previsibilidade de entregas de sprint e a produtividade geral da equipe.",
        "Suportei o pipeline de deploy em produção, fazendo merge e validação de releases no Git para garantir entregas estáveis e de alta qualidade."
      ]
    },
    "experiece4": {
      "year": "2024",
      "text": [
        "Participei da reestruturação completa do frontend e backend, modernizando a stack e infraestrutura para escalabilidade, manutenibilidade e performance.",
        "Migrei o backend de Node.js + Express para NestJS, aplicando princípios SOLID, arquitetura modular e integração completa com PostgreSQL.",
        "Implementei documentação Swagger, melhorei o versionamento de API e estabeleci contratos claros entre equipes de frontend e backend.",
        "Configurei pipelines CI/CD usando GitHub Actions, automatizando workflows de build, teste e deploy para frontend e backend.",
        "Migrei o frontend do Next.js 14 para 15, introduzi React Query para gerenciamento eficiente de estado do servidor e refatorei componentes UI usando TypeScript, Tailwind CSS, DaisyUI e padrões modernos de React.",
        "Implementei testes automatizados com Jest e Cypress, garantindo confiabilidade end-to-end e segurança contra regressões em releases.",
        "Fiz deploy de aplicações frontend e backend no Google Cloud com pipelines de integração e entrega contínuas.",
        "Colaborei estreitamente com designers e stakeholders para definir fluxos de usuário e garantir conexão perfeita entre lógica de negócio e implementação técnica."
      ]
    },
    "experiece5": {
      "year": "2024-2025",
      "text": [
        "Liderei os lançamentos da Cinemark Peru e Paraguai como Technical Lead, coordenando diretamente com clientes e fornecedores para definir estratégias de integração que garantissem transições suaves de plataforma e operações confiáveis de sistema.",
        "Participei de reuniões técnicas com equipes internacionais para alinhar planos de integração backend e frontend, garantindo entrega consistente em ambientes LATAM.",
        "Realizei code reviews e validações arquiteturais, promovendo aderência a princípios de Clean Code e SOLID em toda a equipe de desenvolvimento.",
        "Desenvolvi e mantive a plataforma web internacional da Cinemark LATAM, garantindo alta escalabilidade, performance e localização (Next.js, TypeScript, React Query, Zustand, Node.js, Express, Redis, Jest).",
        "Colaborei com squads multidisciplinares (backend, QA, design, produto) para construir soluções manuteníveis, testáveis e focadas no usuário, alinhadas com objetivos de negócio.",
        "Integrei e otimizei APIs REST para sessões, ingresso e cinemas, melhorando consistência de dados e tempos de resposta em todas as regiões."
      ]
    }
  },
  "Portfolios": {
    "title": "Portfolio",
    "project": "Projeto",
    "projects": [
      {
        "text": "Plataforma internacional Cinemark LATAM.",
        "link": "https://www.cinemark-peru.com/",
        "image": "cinemark"
      },
      {
        "text": "Plataforma reestruturada Enlite.",
        "link": "https://enlite.health/",
        "image": "enlite"
      },
      {
        "text": "Site Nutricionista Elias Lima.",
        "link": "https://nutricionistaeliaslima.com.br/",
        "image": "nutricionista"
      },
      {
        "text": "Loja de brinquedos Rihappy.",
        "link": "https://rihappy.com.br",
        "image": "rihappy"
      },
      {
        "text": "Loja Vivenda do Camarão.",
        "link": "https://www.emporiovivendadocamarao.com.br/",
        "image": "vivenda-do-caramao"
      },
      {
        "text": "Loja Phooto.",
        "link": "https://www.phooto.com.br/",
        "image": "phooto"
      },
      {
        "text": "Loja Katmandu.",
        "link": "https://www.katmandu.com.br/",
        "image": "katmandu"
      },
      {
        "text": "Site SBED.",
        "link": "https://sbed.org.br",
        "image": "sbed"
      },
      {
        "text": "Site São Cristovão.",
        "link": "https://www.saocristovao.com.br/",
        "image": "sao-cristovao"
      },
      {
        "text": "Loja Caido Pneus.",
        "link": "https://www.caiadopneus.com.br/",
        "image": "caiado-pneus"
      },
      {
        "text": "Site Bardahl.",
        "link": "https://bardahl.com.br/",
        "image": "bardahl"
      }
    ]
  },
  "Knowledges": {
    "title": "Conhecimentos",
    "list": [
      {
        "text": "React",
        "image": "react"
      },
      {
        "text": "Html5",
        "image": "html5"
      },
      {
        "text": "Javascript",
        "image": "javascript"
      },
      {
        "text": "Css3",
        "image": "css3"
      },
      {
        "text": "Jquery",
        "image": "jquery"
      },
      {
        "text": "Git",
        "image": "git"
      },
      {
        "text": "Sass",
        "image": "sass"
      },
      {
        "text": "Typescript",
        "image": "typescript"
      },
      {
        "text": "Vtex",
        "image": "vtex"
      },
      {
        "text": "Webpack",
        "image": "webpack"
      },
      {
        "text": "Redux",
        "image": "redux"
      },
      {
        "text": "Styled Component",
        "image": "styled-component"
      },
      {
        "text": "Next",
        "image": "next"
      },
      {
        "text": "Vite",
        "image": "vite"
      },
      {
        "text": "Graphql",
        "image": "graphql"
      },
      {
        "text": "Prisma",
        "image": "prisma"
      },
      {
        "text": "PostgreSql",
        "image": "postgresql"
      },
      {
        "text": "Nest",
        "image": "nest"
      },
      {
        "text": "Node",
        "image": "node"
      },
      {
        "text": "Jest",
        "image": "jest"
      },
      {
        "text": "AWS",
        "image": "aws"
      },
      {
        "text": "Google Cloud",
        "image": "google-cloud"
      },
      {
        "text": "Vercel",
        "image": "versel"
      }
    ]
  },
  "Contacts": {
    "title": "CONTATO",
    "text": "Preencha o formulário e descreva as necessidades do seu projeto e entrarei em contato com você o mais breve possível.",
    "form": {
      "name": "Nome",
      "nameRequired": "Por favor, insira seu nome",
      "nameMsg": "Insira um nome com menos de 20 caracteres",
      "phone": "Telefone",
      "phoneRequired": "Por favor, adicione seu número de telefone",
      "phoneMsg": "Telefone inválido",
      "email": "Email",
      "emailRequired": "Por favor, forneça seu e-mail",
      "emailMsg": "Email inválido",
      "sub": "Assunto",
      "subRequired": "OOPS, você se esqueceu de adicionar o assunto.",
      "description": "Descreva brevemente seu projeto ...",
      "descriptionRequired": "Descreva resumidamente as necessidades do seu projeto ...",
      "formSuccess": "Formulário enviado com sucesso! Estarei entrando em contato em breve, obrigado!"
    },
    "button": "Enviar"
  },
  "Footer": {
    "city": "Cidade"
  }
}
