{
  "Navbar": {
    "text1": "Who I am",
    "text2": "Knowledge",
    "text3": "Services",
    "text4": "Projects",
    "text5": "Contact"
  },
  "Home": {
    "title": "Hello, I am",
    "typedString1": "Full Stack Developer",
    "typedString2": "React.js Specialist",
    "typedString3": "Next.js Developer",
    "button": "contact"
  },
  "AboutMe": {
    "title": "Who I am",
    "text": "Hello! I'm Igor Rocha, a Full Stack Engineer with 6+ years of experience developing scalable and high-performance web applications across LATAM markets. Specialized in React.js, Next.js, TypeScript, and Tailwind CSS, building responsive and maintainable interfaces that drive measurable user engagement. Experienced with Node.js, NestJS, PostgreSQL, and Prisma, delivering reliable API integrations and backend solutions. Contributed to international projects such as Cinemark LATAM, improving system performance, user experience, and release workflows. Strong advocate of Clean Code, SOLID principles, and modern DevOps practices (Docker, GitHub Actions, CI/CD). Collaborative and quality-driven, consistently delivering business-aligned solutions in agile, cross-functional environments."
  },
  "Services": {
    "title": "Services",
    "box1": {
      "title": "Websites e Blogs",
      "text": "Creation of custom websites and blogs."
    },
    "box2": {
      "title": "E-commerce",
      "text": "Building robust and scalable e-commerce platforms."
    },
    "box3": {
      "title": "Dashboards",
      "text": "Development of custom dashboards and data visualizations."
    },
    "box4": {
      "title": "Management Systems",
      "text": "Creation of custom systems for project management."
    }
  },
  "Experiences": {
    "title": "Experiences",
    "experiece1": {
      "year": "2018-2019",
      "text": [
        "Development and maintenance of pages in Wordpress or Vtex for Phooto.",
        "Development and maintenance of E-mail Marketing.",
        "Development of codes for landing page changes according to parameters received.",
        "Implementation of SEO best practices."
      ]
    },
    "experiece2": {
      "year": "2019-2019",
      "text": [
        "Development of e-commerce on the VTEX platform for Katmandu, Vivenda do camarão, Caído Pneus using HTML5, SCSS, Javascript, jQuery.",
        "Development of new features and code refactoring.",
        "Process automation using Postman Collection Runner.",
        "Development and maintenance of websites with Wordpress for São Cristóvão, Saesp and Bardal.",
        "Performance improvement following best practices pointed by Google Pagespeed."
      ]
    },
    "experiece3": {
      "year": "2020-2024",
      "text": [
        "Developed and maintained an e-commerce platform on VTEX for Rihappy.com.br, using HTML5, SCSS, JavaScript, jQuery, Gulp, Babel, Node.js, Webpack, React, TypeScript, and GraphQL — improving page load speed and customer conversion rates.",
        "Implemented new features and refactored legacy code with Next.js and Tailwind CSS, enhancing application performance and maintainability while reducing front-end bugs by 25%.",
        "Managed version control and CI processes with Bitbucket and GitLab, ensuring code integrity and smooth team collaboration.",
        "Applied Scrum methodology to optimize project management, improving sprint delivery predictability and overall team productivity.",
        "Supported the production deployment pipeline, merging and validating releases in Git to guarantee stable and high-quality rollouts."
      ]
    },
    "experiece4": {
      "year": "2024",
      "text": [
        "Participated in the complete redevelopment of the frontend and backend, modernizing the stack and infrastructure for scalability, maintainability, and performance.",
        "Migrated the backend from Node.js + Express to NestJS, applying SOLID principles, modular architecture, and full PostgreSQL integration.",
        "Implemented Swagger documentation, improved API versioning, and established clear contracts between frontend and backend teams.",
        "Configured CI/CD pipelines using GitHub Actions, automating build, test, and deploy workflows for both frontend and backend.",
        "Migrated the frontend from Next.js 14 to 15, introduced React Query for efficient server-state management, and refactored UI components using TypeScript, Tailwind CSS, DaisyUI, and modern React patterns.",
        "Implemented automated testing with Jest and Cypress, ensuring end-to-end reliability and regression safety across releases.",
        "Deployed both frontend and backend applications to Google Cloud with continuous integration and delivery pipelines.",
        "Collaborated closely with designers and stakeholders to define user flows and ensure a seamless connection between business logic and technical implementation."
      ]
    },
    "experiece5": {
      "year": "2024-2025",
      "text": [
        "Led the Cinemark Peru and Paraguay rollouts as Technical Lead, coordinating directly with clients and vendors to define integration strategies that ensured smooth platform transitions and reliable system operations.",
        "Participated in technical meetings with international teams to align backend and frontend integration plans, guaranteeing consistent delivery across LATAM environments.",
        "Conducted code reviews and architectural validations, promoting adherence to Clean Code and SOLID principles across the development team.",
        "Developed and maintained Cinemark LATAM's international web platform, ensuring high scalability, performance, and localization (Next.js, TypeScript, React Query, Zustand, Node.js, Express, Redis, Jest).",
        "Collaborated with cross-functional squads (backend, QA, design, product) to build maintainable, testable, and user-focused solutions aligned with business goals.",
        "Integrated and optimized REST APIs for sessions, ticketing, and theaters, improving data consistency and response times across all regions."
      ]
    }
  },
  "Portfolios": {
    "title": "Portfolio",
    "project": "Project",
    "projects": [
      {
        "text": "Cinemark LATAM international platform.",
        "link": "https://www.cinemark-peru.com/",
        "image": "cinemark"
      },
      {
        "text": "Restructured Enlite platform.",
        "link": "https://enlite.health/",
        "image": "enlite"
      },
      {
        "text": "Nutritionist Elias Lima website.",
        "link": "https://nutricionistaeliaslima.com.br/",
        "image": "nutricionista"
      },
      {
        "text": "Rihappy toy store.",
        "link": "https://rihappy.com.br",
        "image": "rihappy"
      },
      {
        "text": "Vivenda do Camarão Store.",
        "link": "https://www.emporiovivendadocamarao.com.br/",
        "image": "vivenda-do-caramao"
      },
      {
        "text": "Phooto Store.",
        "link": "https://www.phooto.com.br/",
        "image": "phooto"
      },
      {
        "text": "Katmandu Store.",
        "link": "https://www.katmandu.com.br/",
        "image": "katmandu"
      },
      {
        "text": "SBED website",
        "link": "https://sbed.org.br",
        "image": "sbed"
      },
      {
        "text": "São Cristovão website.",
        "link": "https://www.saocristovao.com.br/",
        "image": "sao-cristovao"
      },
      {
        "text": "Caido Pneus website.",
        "link": "https://www.caiadopneus.com.br/",
        "image": "caiado-pneus"
      },
      {
        "text": "Bardahl website.",
        "link": "https://bardahl.com.br/",
        "image": "bardahl"
      }
    ]
  },
  "Knowledges": {
    "title": "Knowledge",
    "list": [
      {
        "text": "React",
        "image": "react"
      },
      {
        "text": "Html5",
        "image": "html5"
      },
      {
        "text": "Javascript",
        "image": "javascript"
      },
      {
        "text": "Css3",
        "image": "css3"
      },

      {
        "text": "Jquery",
        "image": "jquery"
      },
      {
        "text": "Git",
        "image": "git"
      },
      {
        "text": "Sass",
        "image": "sass"
      },
      {
        "text": "Typescript",
        "image": "typescript"
      },

      {
        "text": "Vtex",
        "image": "vtex"
      },
      {
        "text": "Webpack",
        "image": "webpack"
      },
      {
        "text": "Redux",
        "image": "redux"
      },
      {
        "text": "Styled Component",
        "image": "styled-component"
      },
      {
        "text": "Next",
        "image": "next"
      },
      {
        "text": "Vite",
        "image": "vite"
      },
      {
        "text": "Graphql",
        "image": "graphql"
      },
      {
        "text": "Prisma",
        "image": "prisma"
      },
      {
        "text": "PostgreSql",
        "image": "postgresql"
      },
      {
        "text": "Nest",
        "image": "nest"
      },
      {
        "text": "Node",
        "image": "node"
      },
      {
        "text": "Jest",
        "image": "jest"
      },
      {
        "text": "AWS",
        "image": "aws"
      },
      {
        "text": "Google Cloud",
        "image": "google-cloud"
      },
      {
        "text": "Vercel",
        "image": "versel"
      }
    ]
  },
  "Contacts": {
    "title": "CONTACT",
    "text": "Fill out the form and describe your project needs and I will contact you as soon as possible.",
    "form": {
      "name": "Name",
      "nameRequired": "Please enter your name",
      "nameMsg": "Enter a name less than 20 characters long",
      "phone": "Phone",
      "phoneRequired": "Please add your phone number",
      "phoneMsg": "Invalid phone number",
      "email": "Email",
      "emailRequired": "Please provide your email address",
      "emailMsg": "Invalid Email",
      "sub": "Subject",
      "subRequired": "OOPS, you forgot to add the subject",
      "description": "Briefly describe your project ...",
      "descriptionRequired": "Briefly describe your project requirements ...",
      "formSuccess": "Form sent successfully! I will be contacting you soon, thank you!"
    },
    "button": "Send"
  },
  "Footer": {
    "city": "City"
  }
}
